{
    "sender": "Codeforces@codeforces.com",
    "subject": "CodeTON Round 8 (Div. 1 + Div. 2, Rated for Everybody, prizes!)",
    "body": "Attention! The round starts on Saturday, March, 30, 2024 14:35 (UTC).  Hello, chitti1234.\r\n\r\nI'm glad to invite you to take part in CodeTON Round 8. It will be a joint round for Div.1 and Div.2 participants. The round will be rated for all participants. The contest duration is 3 hours. The allowed programming languages are C/C++, Pascal, Java, C#, Python, Ruby, Perl, PHP, Haskell, Scala, OCaml, Go, D, JavaScript, Rust and Kotlin.\r\n\r\nThe round writers are smax, oursaco, sum, cry and buffering. Do not miss the round!\r\n\r\nRegister Now →  And here is the information from our title sponsor:\r\n\r\nHello, Codeforces!\r\n\r\nWe, the TON Foundation team, are pleased to support CodeTON Round 8.\r\n\r\nThe Open Network (TON) is a fully decentralized layer-1 blockchain designed to onboard billions of users to Web3.\r\n\r\nSince July 2022, we have been supporting Codeforces as a title sponsor. This round is another way for us to contribute to the development of the community.\r\n\r\nThe winners of CodeTON Round 8 will receive valuable prizes.\r\n\r\nThe first 1,023 participants will receive prizes in TON cryptocurrency:\r\n\r\n* 1st place: 1,024 TON;\r\n* 2–3 places: 512 TON each;\r\n* 4–7 places: 256 TON each;\r\n* 8–15 places: 128 TON each;\r\n* …\r\n* 512–1,023 places: 2 TON each;\r\n\r\nWe wish you good luck at CodeTON Round 8 and hope you enjoy the contest!\r\n\r\nCodeTON Round 8 will be held on the rules of Codeforces, so read the rules (here and here) beforehand. The round will be for newcomers and participants from the both divisions. Want to compete? Do not forget to register for the contest and check your handle on the registrants page. The registration will be closed 5 minutes before the contest.\r\n\r\nIf you have any questions, please feel free to ask me on the pages of Codeforces. If you no longer wish to receive these emails, click https://codeforces.com/unsubscribe/contests/8afcc6b69f6bc105036ddc86bee6cbbd9fe78e42/ to unsubscribe.\r\n\r\nWish you high rating, MikeMirzayanov and Codeforces team\r\n\r\n"
}